#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

module.snowflake_resources.snowflake_database_role.read: Refreshing state... [id="TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_R"]
module.snowflake_resources.snowflake_database_role.read_write: Refreshing state... [id="TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_RW"]
module.snowflake_resources.snowflake_database_role.owner: Refreshing state... [id="TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_O"]
module.snowflake_resources.snowflake_grant_database_role.o_inherits_rw: Refreshing state... [id="TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_O"|DATABASE ROLE|"TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_RW"]
module.snowflake_resources.snowflake_grant_database_role.rw_inherits_r: Refreshing state... [id="TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_RW"|DATABASE ROLE|"TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_R"]
module.snowflake_resources.snowflake_grant_privileges_to_database_role.usage_to_r: Refreshing state... [id="TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_R"|false|false|USAGE|OnSchema|OnSchema|"TEST_PROD"."FIRST_TF_SCHEMA"]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.snowflake_resources.snowflake_database_role.owner has been deleted
  - resource "snowflake_database_role" "owner" {
        id                   = "\"TEST_PROD\".\"ROLE_TEST_PROD_FIRST_TF_SCHEMA_O\""
      - name                 = "ROLE_TEST_PROD_FIRST_TF_SCHEMA_O" -> null
        # (4 unchanged attributes hidden)
    }

  # module.snowflake_resources.snowflake_database_role.read has been deleted
  - resource "snowflake_database_role" "read" {
        id                   = "\"TEST_PROD\".\"ROLE_TEST_PROD_FIRST_TF_SCHEMA_R\""
      - name                 = "ROLE_TEST_PROD_FIRST_TF_SCHEMA_R" -> null
        # (4 unchanged attributes hidden)
    }

  # module.snowflake_resources.snowflake_database_role.read_write has been deleted
  - resource "snowflake_database_role" "read_write" {
        id                   = "\"TEST_PROD\".\"ROLE_TEST_PROD_FIRST_TF_SCHEMA_RW\""
      - name                 = "ROLE_TEST_PROD_FIRST_TF_SCHEMA_RW" -> null
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.snowflake_resources.snowflake_database_role.owner will be created
  + resource "snowflake_database_role" "owner" {
      + database             = "PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PROD_FIRST_O"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database_role.read will be created
  + resource "snowflake_database_role" "read" {
      + database             = "PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PROD_FIRST_R"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database_role.read_write will be created
  + resource "snowflake_database_role" "read_write" {
      + database             = "PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PROD_FIRST_RW"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_grant_database_role.o_inherits_rw will be created
  + resource "snowflake_grant_database_role" "o_inherits_rw" {
      + database_role_name        = "\"PROD\".\"ROLE_PROD_FIRST_O\""
      + id                        = (known after apply)
      + parent_database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_RW\""
    }

  # module.snowflake_resources.snowflake_grant_database_role.rw_inherits_r will be created
  + resource "snowflake_grant_database_role" "rw_inherits_r" {
      + database_role_name        = "\"PROD\".\"ROLE_PROD_FIRST_RW\""
      + id                        = (known after apply)
      + parent_database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_all_tables will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_all_tables" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_select_on_future_tables will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_select_on_future_tables" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PROD\".\"FIRST\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.usage_to_r will be created
  + resource "snowflake_grant_privileges_to_database_role" "usage_to_r" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PROD\".\"ROLE_PROD_FIRST_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "\"PROD\".\"FIRST\""
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Failed to query database. Marking the resource as removed.

  with module.snowflake_resources.snowflake_database_role.read,
  on ../modules/snowflake_resources/grants.tf line 1, in resource "snowflake_database_role" "read":
   1: resource "snowflake_database_role" "read" {

database role name: "TEST_PROD"."ROLE_TEST_PROD_FIRST_TF_SCHEMA_R", Err:
object does not exist

(and 2 more similar warnings elsewhere)

Warning: Failed to retrieve grants. Target object not found. Marking the resource as removed.

  with module.snowflake_resources.snowflake_grant_privileges_to_database_role.usage_to_r,
  on ../modules/snowflake_resources/grants.tf line 34, in resource "snowflake_grant_privileges_to_database_role" "usage_to_r":
  34: resource "snowflake_grant_privileges_to_database_role" "usage_to_r" {

Id: 

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Abhinandan90, Action: `pull_request`*